<center>
  <a href="2.2.Intro-to-pandas_SERIES.ipynb">Previous Page</a> | <a href="./">Content Page</a> | <a href="2.4.Summary%20Statistics%20in%20Dataframe.ipynb">Next Page</a></center>
</center>

# 2.3 Introduction to pandas Data Structures (DataFrame)

As explained, two workhorse data structures are *Series* and *Data Frames*.  

Here, we are going to examine Data Frames.

## 2.3.1 DataFrame 

DataFrames are tabular, spreadsheet-like data. Crucially, each column can be of a different data type, for example a column of `numbers` followed by a column of `boolean` True and False values then a column of `characters` containing names.

### Create DataFrame

In [2]:
from pandas import DataFrame

In [3]:
# manual create a toy data frame 
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
# columns 1, 2, 3 (the order) depends alphabethically
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

### Another ways to Create by Row, and by Column (Transpose is required)

In [5]:
import pandas as pd

In [6]:
#By Row
data1 = [[1.5,'Ohio', 2000],
         [21.7,'Ohio', 2001],
         [3.6, 'Ohio', 2002],
         [2.4,'Nevada', 2001],
         [2.9,'Nevada', 2002]]
frame=pd.DataFrame(data1)
frame.columns=['pop', 'state', 'year']
frame

    pop   state  year
0   1.5    Ohio  2000
1  21.7    Ohio  2001
2   3.6    Ohio  2002
3   2.4  Nevada  2001
4   2.9  Nevada  2002

##### Creating based on Column

In [7]:
data1 = [['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], [2000, 2001, 2002, 2001, 2002],[1.5, 1.7, 3.6, 2.4, 2.9]]
frame2=pd.DataFrame(data1).transpose()
frame2.columns=['state', 'year', 'pop']
frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

### Two ways to Retrieve a Column

In [8]:
# two ways to retrieve a column in a data frame 
# dict-like notation 
frame['state']
#frame['year sold']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [9]:
# by attribute 
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

## Exercise 2.3.1: Dataframe

1. `data5` is provided for you below.
2. Convert `data5` into a dataframe and named it as `dataframe`
3. Add columns `Title, Rating, Genre` for `dataframe`
* Retrieve 'Genre' column by specifying its `attribute`

In [10]:
data5 = [['Forrest Gum', 5.0, 'Romance'],
         ['Mr and Mrs Smith', 4,'Romance'],
         ['Notebook', 3,'Romance'],
         ['Proposal', 3,'Romance'],
         ['True Lies', 5,'Romance'],
         ['Mr and Mrs Smith', 3.5,'Action'],
         ['Police Story', 5,'Action'],
         ['Taken', 4,'Action'],
         ['True Lies', 4.5,'Action']]

In [108]:
dataframe=pd._____(____)
dataframe.columns=['Title', '____', 'Genre']

In [111]:
frame.____

0    Romance
1    Romance
2    Romance
3    Romance
4    Romance
5     Action
6     Action
7     Action
8     Action
Name: Genre, dtype: object

## 2.3.2 Indexing using loc and iloc

This allows us to subset a data frame based on specific rows and columns from a Data Frame.

In [11]:
import numpy as np
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

##### As explained, we can use dict-like notation to retrieve columns

In [12]:
data.one

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

##### As explained, we can use dict-like notation to retrieve columns OR by ATTRIBUTE

In [13]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

##### We can also retrieve it as a dataframe

In [14]:
data[['one']]

          one
Ohio        0
Colorado    4
Utah        8
New York   12

##### Similarly, we can use loc (dict-like retrieving method) and iloc (index, number-like)

In [15]:
data.loc[:, 'one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [16]:
data.loc[:, ['one']]

          one
Ohio        0
Colorado    4
Utah        8
New York   12

##### loc: Using keyword to retrieve

In [18]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [20]:
data.loc[:,['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [21]:
# Retriving columns does not have to be in sequence
## start with 'four', 'one', and 'two'
data.loc[['Colorado','Utah'], ['four', 'one', 'two']]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [22]:
# the row from the beginning till 'Utah', get column 'two' as Series
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [23]:
# the row from the beginning till 'Utah', get column 'two' as dataframe
data.loc[:'Utah',['two']]

          two
Ohio        1
Colorado    5
Utah        9

##### iloc: using number to retrieve

In [24]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
# subset the third row. Don't forget Python counts start from 0
##Utah
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [26]:
# subset the third row. Don't forget Python counts start from 0
## OLD way
data.ix[2]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

#### Mix iloc and loc

In [27]:
data.ix[0:3,['one', 'three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10

#### iloc will complain

In [28]:
data.iloc[0:3,['one', 'three']]

TypeError: cannot perform reduce with flexible type

#### loc will complain

In [29]:
data.loc[0:3,['one', 'three']]

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [30]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [32]:
# Retriving columns does not have to be in sequence
## start with 'four', 'one', and 'two'
data.loc[['Colorado','Utah'], ['four', 'one', 'two']]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

### Exercise 2.3.2: Indexing 

The DataFrame below shows the subject scores of four students. 

Using the `indexing notation` we covered above, 

1. What was Jane's score for Math? 
2. What was Jane and Jordan's score for history? 
3. What was the score of all four students for English?

In [51]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Jared','Jane','Josiah','Jordan'],
                 columns=['History', 'Chinese', 'Math', 'English'])
data

        History  Chinese  Math  English
Jared         0        1     2        3
Jane          4        5     6        7
Josiah        8        9    10       11
Jordan       12       13    14       15

What was Jane's score for Math? Use iloc and loc?

In [160]:
data.iloc[____,____]

6

In [162]:
data.loc[____,____]

6

What was Jane and Jordan's score for history?

In [167]:
data.iloc[[____,____],____]

Jane       4
Jordan    12
Name: History, dtype: int32

In [168]:
data.loc[['____', '____'],'____']

Jane       4
Jordan    12
Name: History, dtype: int32

What was the score of all four students for English?

In [94]:
data.iloc[____,____]

Jared      3
Jane       7
Josiah    11
Jordan    15
Name: English, dtype: int32

In [171]:
data.loc[____,____]

Jared      3
Jane       7
Josiah    11
Jordan    15
Name: English, dtype: int32

<center>
  <a href="2.2.Intro-to-pandas_SERIES.ipynb">Previous Page</a> | <a href="./">Content Page</a> | <a href="2.4.Summary%20Statistics%20in%20Dataframe.ipynb">Next Page</a></center>
</center>

#### More detailed information: 
https://pandas.pydata.org/pandas-docs/stable/dsintro.html<br>
https://discuss.analyticsvidhya.com/t/what-is-the-difference-between-pandas-series-and-python-lists/27373/2
https://stackoverflow.com/questions/26047209/what-is-the-difference-between-a-pandas-series-and-a-single-column-dataframe

### Possible Solution:
#### Exercise 2.3.1: Dataframe

In [33]:
data5 = [['Forrest Gum', 5.0, 'Romance'],
         ['Mr and Mrs Smith', 4,'Romance'],
         ['Notebook', 3,'Romance'],
         ['Proposal', 3,'Romance'],
         ['True Lies', 5,'Romance'],
         ['Mr and Mrs Smith', 3.5,'Action'],
         ['Police Story', 5,'Action'],
         ['Taken', 4,'Action'],
         ['True Lies', 4.5,'Action']]

In [34]:
dataframe=pd.DataFrame(data5)
dataframe.columns=['Title', 'Rating', 'Genre']
dataframe.Genre

0    Romance
1    Romance
2    Romance
3    Romance
4    Romance
5     Action
6     Action
7     Action
8     Action
Name: Genre, dtype: object

##### Exercise 2.3.2:Indexing

In [26]:
from pandas import DataFrame
import numpy as np
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Jared','Jane','Josiah','Jordan'],
                 columns=['History', 'Chinese', 'Math', 'English'])
data

        History  Chinese  Math  English
Jared         0        1     2        3
Jane          4        5     6        7
Josiah        8        9    10       11
Jordan       12       13    14       15

In [20]:
#What was Jane's score for Math? Use iloc and loc?

In [27]:
data.iloc[1,2]

6

In [31]:
data.loc['Jane','Math']

6

What was Jane and Jordan's score for history?

In [ ]:
data.iloc[[1,3],0]

In [32]:
data.loc[['Jane', 'Jordan'],'History']

Jane       4
Jordan    12
Name: History, dtype: int32

What was the score of all four students for English?

In [33]:
data.iloc[:,3]

Jared      3
Jane       7
Josiah    11
Jordan    15
Name: English, dtype: int32

In [34]:
data.loc[:,'English']

Jared      3
Jane       7
Josiah    11
Jordan    15
Name: English, dtype: int32